cases/ANWT_dropHeight_03D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          150642;
        startFace       302751;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          150642;
        startFace       453393;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          71;
        startFace       604035;
    }
    tankWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       604106;
    }
    atmosphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          58;
        startFace       604166;
    }

    floatingBody
    {
        type            wall;
        inGroups        1(wall);
        nFaces          259;
        startFace       604224;
    }

)

// ************************************************************************* //
