cases/ANWT_dropHeight_03D/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;
sourceCase "$FOAM_CASE";

sourcePatches (front);
exposedPatchName back;

extrudeModel wedge;
mergeFaces false;
nLayers 1;
expansionRatio 1.0;


   axisPt      (0 0 -2);

   axis        (0 0 1);

   angle       2; 

flipNormals true;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
