cases/ANWT_dropHeight_03D/system/extrudeMeshDict.Down3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


constructFrom mesh;
sourceCase "$FOAM_CASE";

sourcePatches (bottom);
exposedPatchName bottom;

extrudeModel    linearNormal;
    nLayers 6;
    expansionRatio 1;
    
    direction       (0 0 -1);
        thickness       0.24;


flipNormals false;
mergeFaces false;
        
        
flipNormals false;
mergeFaces false;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
