cases/ANWT_dropHeight_03D/system/extrudeMeshDict.Wall1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


constructFrom mesh;
sourceCase "$FOAM_CASE";

sourcePatches (tankWall);
exposedPatchName tankWall;

extrudeModel    linearDirection;
    nLayers 20;
    expansionRatio 1;
    
    direction       (1 0 0);
        thickness       0.2;


flipNormals false;
mergeFaces false;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
