cases/ANWT_dropHeight_03D/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
defaultFieldValues
(
    volScalarFieldValue alpha1 0
    volScalarFieldValue p_rgh 0
);


expressions
(
    alpha1
    {
	field alpha1;
	expression "1";
	condition "pos().z<0";
	keepPatches 1;
    }
    pressureWater
    {
	field p_rgh;
	expression "-997*9.81*pos().z";
	condition "pos().z<0";
	keepPatches 1;
    }
);

