cases/ANWT_dropHeight_03D/system/topoSetDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    cR;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1000 -1000 -1.2) (0.6 1000 0.18);
        }
    }
   // {
   //     name    c0;
   //     type    cellSet;
   //     action  invert;
   // }
);

// ************************************************************************* //
